const treeData = [
    {
        "children": [
            {
                "children": [
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "children": [
                                            {
                                                "sex": "ប",
                                                "name": "ធឿនវិចិត្រ ទិត្យវណ្ឌី"
                                            },
                                            {
                                                "sex": "ស",
                                                "name": "ធឿនវិចិត្រ ទិត្យសុវណ្ណនារី"
                                            },
                                            {
                                                "sex": "ស",
                                                "name": "ធឿនវិចិត្រ ទិត្យវណ្ណដែត"
                                            },
                                            {
                                                "sex": "ប",
                                                "name": "ធឿនវិចិត្រ ទិត្យវណ្ណដេត"
                                            }
                                        ],
                                        "sex": "ស",
                                        "name": "ភិន សុចិន្តា 💕 ឌិល វិចិត្រ"
                                    },
                                    {
                                        "children": [
                                            {
                                                "sex": "ស",
                                                "name": "ផល សុម៉ានិច"
                                            },
                                            {
                                                "sex": "ប",
                                                "name": "ផល សុវឌ្ឍនា"
                                            }
                                        ],
                                        "sex": "ស",
                                        "name": "ភិន សុគន្ធ 💕 ឆឹម តារា"
                                    },
                                    {
                                        "sex": "ប",
                                        "name": "ភិន សុវិរក្ស"
                                    }
                                ],
                                "sex": "ស",
                                "name": "ម៉ោល សាម៉េត 💕 ភិន ខ្នុន"
                            },
                            {
                                "children": [
                                    {
                                        "children": [
                                            {
                                                "sex": "ប",
                                                "name": "សត្យា ពន្លឺស័ក្តដា"
                                            },
                                            {
                                                "sex": "ស",
                                                "name": "សត្យា ម៉ូលីកា"
                                            }
                                        ],
                                        "sex": "ប",
                                        "name": "ស៊ីម សត្យា 💕 ប៉ោង ស៊ីផេត"
                                    },
                                    {
                                        "sex": "ស",
                                        "name": "ស៊ីម ចាន់តារារស្មី"
                                    }
                                ],
                                "sex": "ប",
                                "name": "ម៉ោល ស៊ីម 💕 យឹម ប៉ុនណា"
                            },
                            {
                                "children": [
                                    {
                                        "sex": "ប",
                                        "name": "សុទ្ធ រ៉ាសាល (ចិន)"
                                    },
                                    {
                                        "sex": "ប",
                                        "name": "សុទ្ធ រ៉ាស៊ីន (ម៉ៅ)"
                                    }
                                ],
                                "sex": "ប",
                                "name": "ម៉ោល សុទ្ធ 💕 ច័ន្ទ ស្រីចាន់"
                            },
                            {
                                "sex": "ប",
                                "name": "ម៉ោល ញ៉ាច"
                            },
                            {
                                "children": [
                                    {
                                        "sex": "ស",
                                        "name": "ពិសិដ្ឋ សៀវហេង"
                                    },
                                    {
                                        "sex": "ប",
                                        "name": "ពិសិដ្ឋ លីហួ"
                                    },
                                    {
                                        "sex": "ប",
                                        "name": "ពិសិដ្ឋ មង្គល"
                                    },
                                    {
                                        "sex": "ប",
                                        "name": "ពិសិដ្ឋ ឫទ្ធិឧត្តម"
                                    }
                                ],
                                "sex": "ប",
                                "name": "ម៉ោល ពិសិដ្ឋ 💕 ប៉ាញ សុវណ្ណារី"
                            },
                            {
                                "children": [
                                    {
                                        "sex": "ប",
                                        "name": "សាន អធិភូ"
                                    },
                                    {
                                        "sex": "ប",
                                        "name": "សាន សុភូមី"
                                    },
                                    {
                                        "sex": "ប",
                                        "name": "សាន សិរីធនិន"
                                    }
                                ],
                                "sex": "ប",
                                "name": "ម៉ោល សាន 💕 ឆៃ សៅឌី"
                            }
                        ],
                        "sex": "ប",
                        "name": "អ៊ុំ មឹម 💕 ម៉ោល សឿន"
                    },
                    {
                        "children": [
                            {
                                "sex": "ស",
                                "name": "ហ៊ឹម សាម៉េន"
                            },
                            {
                                "children": [
                                    {
                                        "children": [
                                            {
                                                "sex": "ប",
                                                "name": "ធីសុភ័គ វីរវិទូ (ELLON)"
                                            },
                                            {
                                                "sex": "ប",
                                                "name": "ធីសុភ័គ វីរៈនរិន្ទ (ELBER)"
                                            }
                                        ],
                                        "sex": "ស",
                                        "name": "ហ៊ឹម ឃឹមសុភ័គ 💕 ហ៊ិត ចន្ធី"
                                    },
                                    {
                                        "sex": "ប",
                                        "name": "ហ៊ឹមឃឹម សុវិទ្យា (តុលា)"
                                    },
                                    {
                                        "sex": "ស",
                                        "name": "ហ៊ឹមឃឹម សុបូលីន"
                                    }
                                ],
                                "sex": "ស",
                                "name": "ហ៊ឹម សាម៉េត 💕 ឃឹម ខាន់"
                            }
                        ],
                        "sex": "ស",
                        "name": "អ៊ុំ សាមន 💕 ហ៊ឹម ម៉ៅ"
                    },
                    {
                        "sex": "ប",
                        "name": "អ៊ុំ សាមិន"
                    }
                ],
                "sex": "ស",
                "name": "ប្រាក់ មិត្ត 💕 អ៊ុំ ផាន់"
            },
            {
                "children": [
                    {
                        "sex": "ប",
                        "name": "ប្រាក់ គីន"
                    }
                ],
                "sex": "ប",
                "name": "ប្រាក់ ម៉ន 💕 យាយទួន"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "children": [
                                            {
                                                "sex": "ប",
                                                "name": "វែន លីហួរ"
                                            },
                                            {
                                                "sex": "ប",
                                                "name": "វែន លីហៀង"
                                            }
                                        ],
                                        "sex": "ស",
                                        "name": "ភុន បូតា 💕 វែន គើល"
                                    },
                                    {
                                        "sex": "ប",
                                        "name": "ភុន វណ្ណៈ"
                                    },
                                    {
                                        "sex": "ប",
                                        "name": "ភុន បូរិន"
                                    },
                                    {
                                        "sex": "ប",
                                        "name": "ភុន បូផៃ"
                                    },
                                    {
                                        "children": [
                                            {
                                                "sex": "ប",
                                                "name": "ផាន់ណា ផាត"
                                            }
                                        ],
                                        "sex": "ស",
                                        "name": "ភុន បូផាន់ 💕 វណ្ណា"
                                    },
                                    {
                                        "sex": "ប",
                                        "name": "ភុន បូភីម"
                                    }
                                ],
                                "sex": "ស",
                                "name": "ខយ ឌីណា 💕 ភុន សុផុន (ភួយ)"
                            }
                        ],
                        "sex": "ស",
                        "name": "គាត រ័ត្ន 💕 តាខយ"
                    },
                    {
                        "sex": "ប",
                        "name": "គាត គឹមអាន"
                    },
                    {
                        "children": [
                            {
                                "sex": "ប",
                                "name": "យ៉ាន ចាន់"
                            },
                            {
                                "sex": "ស",
                                "name": "យ៉ាន ចាន់ធី"
                            },
                            {
                                "children": [
                                    {
                                        "children": [
                                            {
                                                "sex": "ប",
                                                "name": "ធីសុភ័គ វីរវិទូ (ELLON)"
                                            },
                                            {
                                                "sex": "ប",
                                                "name": "ធីសុភ័គ វីរៈនរិន្ទ (ELBER)"
                                            }
                                        ],
                                        "sex": "ប",
                                        "name": "ហ៊ិត ចន្ធី 💕 ហ៊ឹម ឃឹមសុភ័គ"
                                    },
                                    {
                                        "sex": "ប",
                                        "name": "ឡុង ធា 💕 ផុន ធារី"
                                    },
                                    {
                                        "sex": "ប",
                                        "name": "វិត្ថា គាលៃ 💕 ស៊ន ស្រីនិច្ច"
                                    },
                                    {
                                        "children": [
                                            {
                                                "sex": "ស",
                                                "name": "ឌីដេត មល្លិកា (កាកា)"
                                            }
                                        ],
                                        "sex": "ស",
                                        "name": "វិត្ថា ចន្ធីម"
                                    },
                                    {
                                        "sex": "ប",
                                        "name": "វិត្ថា សុថេត"
                                    },
                                    {
                                        "sex": "ស",
                                        "name": "វិត្ថា មករា"
                                    },
                                    {
                                        "sex": "ប",
                                        "name": "វិត្ថា តុលា"
                                    },
                                    {
                                        "sex": "ប",
                                        "name": "វិត្ថា នភា"
                                    }
                                ],
                                "sex": "ស",
                                "name": "យ៉ាន ចាន់ធូរ 💕 ហ៊ិត វិត្ថា (ឡុង)"
                            }
                        ],
                        "sex": "ស",
                        "name": "គាត រឿន 💕 យូ យ៉ាន"
                    },
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "sex": "ស",
                                        "name": "ស្រីពេជ្យ"
                                    },
                                    {
                                        "sex": "ប",
                                        "name": "សក្តិ"
                                    }
                                ],
                                "sex": "ប",
                                "name": "បឿន ចាន់ប៊ន 💕 ផន សុភ័ក្រ្ត"
                            },
                            {
                                "children": [
                                    {
                                        "sex": "ប",
                                        "name": "បូណា សុវឌ្ឍនៈ (សានម៉ៅ)"
                                    },
                                    {
                                        "sex": "ស",
                                        "name": "បូណា ដានី (ស្រីល័ក្ខ)"
                                    },
                                    {
                                        "sex": "ស",
                                        "name": "បឿន ចាន់សិរី (គឹមឡេង)"
                                    }
                                ],
                                "sex": "ប",
                                "name": "បឿន បូណា (ប៊ុន) 💕 ខ្លូត សារ៉ូ"
                            },
                            {
                                "children": [
                                    {
                                        "sex": "ស",
                                        "name": "បូរិន ម៉ាលី"
                                    },
                                    {
                                        "sex": "ប",
                                        "name": "បូរិន ម៉ាសារ៉ា (ដុងហេ)"
                                    }
                                ],
                                "sex": "ប",
                                "name": "ប៊ិន បូរិន (ពីន) 💕 សារ៉ាយ (ណាយ)"
                            },
                            {
                                "sex": "ស",
                                "name": "ប៊ិន អេឡែន (សារ៉ែន)"
                            }
                        ],
                        "sex": "ស",
                        "name": "គាត រឹម 💕 ដុំ បឿន"
                    },
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "sex": "ប",
                                        "name": "ឱក ចិត្រា"
                                    }
                                ],
                                "sex": "ប",
                                "name": "ជុំ ចន្ទ្រា 💕 ម៉ៅ ស្រីពៅ"
                            },
                            {
                                "sex": "ប",
                                "name": "ជុំ រស្មី"
                            },
                            {
                                "sex": "ស",
                                "name": "ជុំ សុគន្ធា"
                            }
                        ],
                        "sex": "ប",
                        "name": "គាត គឹមឱក"
                    },
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "sex": "ប",
                                        "name": "សុខ តុងថៃ"
                                    }
                                ],
                                "sex": "ស",
                                "name": "ហៀង ទីហួង"
                            }
                        ],
                        "sex": "ស",
                        "name": "គាត រី"
                    },
                    {
                        "children": [
                            {
                                "sex": "ស",
                                "name": "អន ធីតា"
                            },
                            {
                                "sex": "ស",
                                "name": "អន ធីដេ"
                            },
                            {
                                "sex": "ប",
                                "name": "អន វណ្ណដេត"
                            }
                        ],
                        "sex": "ប",
                        "name": "គាត អន (អោង) 💕 ជា ច្រិប"
                    }
                ],
                "sex": "ស",
                "name": "ប្រាក់ មាស 💕 គាត ជុំ"
            },
            {
                "children": [
                    {
                        "sex": "ប",
                        "name": "ប្រាក់ វុធ"
                    },
                    {
                        "sex": "ប",
                        "name": "ប្រាក់ វ៉ាន់"
                    },
                    {
                        "children": [
                            {
                                "sex": "ប",
                                "name": "ប្រាក់ រស្មី 💕 ឈិន ស្រីលៀង"
                            },
                            {
                                "sex": "ប",
                                "name": "ប្រាក់ រក្សា"
                            },
                            {
                                "sex": "ស",
                                "name": "ប្រាក់ ឧស្សាហ៍"
                            }
                        ],
                        "sex": "ប",
                        "name": "ប្រាក់ សាវី (ខ្លយ) 💕 សួស ស៊ីណាត (នាង)"
                    },
                    {
                        "sex": "ប",
                        "name": "ប្រាក់ ហុង"
                    }
                ],
                "sex": "ប",
                "name": "ប្រាក់ សៅ 💕 ឈឹម លៀង"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "sex": "ប",
                                        "name": "???"
                                    }
                                ],
                                "sex": "ប",
                                "name": "សំ រុង (ការ៉ុង)"
                            },
                            {
                                "children": [
                                    {
                                        "sex": "ស",
                                        "name": "ស៊ុន ដាលីន"
                                    },
                                    {
                                        "sex": "ស",
                                        "name": "ស៊ុន សុនិតា"
                                    },
                                    {
                                        "sex": "ស",
                                        "name": "ស៊ុន មួយឃាង"
                                    }
                                ],
                                "sex": "ស",
                                "name": "សំ សូនី 💕 ស៊ុន សុវុទ្ធី"
                            },
                            {
                                "children": [
                                    {
                                        "sex": "ប",
                                        "name": "ណូត ច័ន្ទគីរី"
                                    },
                                    {
                                        "sex": "ប",
                                        "name": "ណូត សុវណ្ណា"
                                    }
                                ],
                                "sex": "ស",
                                "name": "សំ ស៊ីណាត 💕 ណូត សុខនឿ"
                            },
                            {
                                "children": [
                                    {
                                        "sex": "ប",
                                        "name": "សាន្ត សុផានិត"
                                    },
                                    {
                                        "sex": "ប",
                                        "name": "សាន្ត សុជា"
                                    },
                                    {
                                        "sex": "ស",
                                        "name": "សាន្ត ស៊ាវឈិញ"
                                    }
                                ],
                                "sex": "ប",
                                "name": "សំ សុភារិទ្ធ 💕 ???"
                            }
                        ],
                        "sex": "ប",
                        "name": "សំ សាន្ត (បាវ) 💕 ??? វ៉ាលី"
                    },
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "sex": "ប",
                                        "name": "ភី វីរៈយុទ្ធ"
                                    },
                                    {
                                        "sex": "ប",
                                        "name": "ភី សុភបុត្រ"
                                    },
                                    {
                                        "sex": "ស",
                                        "name": "ភី សុភវត្តី"
                                    }
                                ],
                                "sex": "ប",
                                "name": "សំ សុភី 💕 ស៊ គីមសែ"
                            },
                            {
                                "sex": "ប",
                                "name": "សំ សុខីណា 💕 ហុន ស្រីឡា"
                            },
                            {
                                "sex": "ស",
                                "name": "សំ សុជាតា"
                            },
                            {
                                "sex": "ប",
                                "name": "សំ ម៉ារ៉ាឌី"
                            }
                        ],
                        "sex": "ប",
                        "name": "សំ សុខា (ម៉ៅ) 💕 ឡេង ស៊ីវខេង"
                    },
                    {
                        "children": [
                            {
                                "sex": "ប",
                                "name": "??? ធឿន"
                            },
                            {
                                "sex": "ស",
                                "name": "??? ស្រី"
                            }
                        ],
                        "sex": "ស",
                        "name": "សំ សៅលី (ទូច)"
                    },
                    {
                        "children": [
                            {
                                "sex": "ស",
                                "name": "ចាន់ វីរិយានិត"
                            },
                            {
                                "sex": "ប",
                                "name": "ចាន់ សុមេធា"
                            }
                        ],
                        "sex": "ស",
                        "name": "សំ ស៊ីនន 💕 ចាន់ សាម៉េត"
                    },
                    {
                        "sex": "ប",
                        "name": "សំ កុសល"
                    }
                ],
                "sex": "ប",
                "name": "ប្រាក់ សំ 💕 ??? យន"
            },
            {
                "children": [
                    {
                        "sex": "ប",
                        "name": "អិន លុច"
                    },
                    {
                        "sex": "ស",
                        "name": "អិន លីស (ញិល)"
                    }
                ],
                "sex": "ស",
                "name": "ប្រាក់ មុំ 💕 អិន ឡុង"
            },
            {
                "children": [
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "sex": "ប",
                                        "name": "ចិត្រា មុនីវណ្ណ (បុង)"
                                    }
                                ],
                                "sex": "ស",
                                "name": "ខុម ចន្ទមុនីនាថ (ណែត) 💕 នី ចិត្រា"
                            },
                            {
                                "children": [
                                    {
                                        "sex": "ប",
                                        "name": "ខុម ចន្ទសេរីវង្ស (ប៊ែល)"
                                    }
                                ],
                                "sex": "ប",
                                "name": "ខុម ចន្ទសេរីវឌ្ឍន៍ (ដំ) 💕 កើត សារ៉ាយ"
                            }
                        ],
                        "sex": "ស",
                        "name": "ឱម សុខុម 💕 សុខ សុខុម"
                    },
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "sex": "ប",
                                        "name": "សង្វាត សុគុន្ធវិសាល (ប៉ាវី)"
                                    },
                                    {
                                        "sex": "ប",
                                        "name": "ហេង សំណាងរតនៈ"
                                    }
                                ],
                                "sex": "ប",
                                "name": "ហេង សង្វាត (ស្តើង)"
                            },
                            {
                                "sex": "ប",
                                "name": "ហេង វណ្ណា"
                            },
                            {
                                "children": [
                                    {
                                        "sex": "ស",
                                        "name": "ហេង ស្រីណុច"
                                    },
                                    {
                                        "sex": "ស",
                                        "name": "ហេង វណ្នីដា"
                                    }
                                ],
                                "sex": "ប",
                                "name": "ហេង វណ្ណះ 💕 ប៉ោង ស្រីណេត"
                            },
                            {
                                "children": [
                                    {
                                        "sex": "ស",
                                        "name": "កាំង សូលិតា"
                                    }
                                ],
                                "sex": "ស",
                                "name": "ហេង មល្លិកា 💕 ហ៊ុត កាង"
                            },
                            {
                                "children": [
                                    {
                                        "sex": "ប",
                                        "name": "ស៊ិន រ័ត្នធារិទ្ធ"
                                    }
                                ],
                                "sex": "ស",
                                "name": "ហេង សុវណ្ណារ័ត្ន 💕 ស៊ិន ចាន់ស៊ី"
                            }
                        ],
                        "sex": "ស",
                        "name": "ឱម សាឃន 💕 ហេង វ៉ាន"
                    },
                    {
                        "sex": "ប",
                        "name": "ឱម សាខន"
                    },
                    {
                        "children": [
                            {
                                "children": [
                                    {
                                        "sex": "ស",
                                        "name": "ខឿន លីអឺ"
                                    },
                                    {
                                        "sex": "ប",
                                        "name": "ខឿន បញ្ញា"
                                    }
                                ],
                                "sex": "ស",
                                "name": "ខឿន សុខេមា"
                            },
                            {
                                "children": [
                                    {
                                        "sex": "ស",
                                        "name": "ខឿន សុខភីរ៉ាណាន់"
                                    }
                                ],
                                "sex": "ប",
                                "name": "ឱម ខេមរិន 💕 អេង សុផានី"
                            },
                            {
                                "sex": "ប",
                                "name": "ឱម សៅឌី (ម៉ៅ)"
                            },
                            {
                                "sex": "ប",
                                "name": "ខឿន សុមារី"
                            }
                        ],
                        "sex": "ប",
                        "name": "ឱម សាខឿន 💕 ផេង អុក"
                    },
                    {
                        "sex": "ស",
                        "name": "ឱម សុឃីម"
                    },
                    {
                        "children": [
                            {
                                "sex": "ស",
                                "name": "ផាត សុខាល័យ (គន្ធា)"
                            },
                            {
                                "sex": "ស",
                                "name": "ផាត សុខាវត្តី (បុផ្ផា)"
                            }
                        ],
                        "sex": "ស",
                        "name": "ឱម សុខា 💕 ម៉ក់ សុផាត"
                    },
                    {
                        "sex": "ស",
                        "name": "ឱម សុឃឹន"
                    },
                    {
                        "sex": "ប",
                        "name": "ឱម សុខខេមរ៉ា"
                    }
                ],
                "sex": "ស",
                "name": "ប្រាក់ ម៉ាន់ 💕 ឱម សាប៊ិត"
            }
        ],
        "sex": "ប",
        "name": "ប្រាក់ ផាច 💕 យាយតាក់"
    }
];

export default treeData;